test/loadtest/results.txt
 █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=47.57ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.30%


  █ TOTAL RESULTS 

    checks_total.......: 5990   182.869275/s
    checks_succeeded...: 99.69% 5972 out of 5990
    checks_failed......: 0.30%  18 out of 5990

    ✗ Team Add team_alpha: 201
      ↳  0% — ✓ 0 / ✗ 1
    ✗ Team Add team_beta: 201
      ↳  0% — ✓ 0 / ✗ 1
    ✗ Team Add: 201
      ↳  99% — ✓ 1493 / ✗ 4
    ✗ Team Get: 200
      ↳  99% — ✓ 1493 / ✗ 4
    ✗ PR Create: 201
      ↳  99% — ✓ 1493 / ✗ 4
    ✗ Team deactivation: 200
      ↳  99% — ✓ 1493 / ✗ 4

    HTTP
    http_req_duration..............: avg=9.91ms   min=503µs    med=3.16ms   max=203.85ms p(90)=17.98ms p(95)=47.57ms
      { expected_response:true }...: avg=9.92ms   min=503µs    med=3.16ms   max=203.85ms p(90)=18.01ms p(95)=48.15ms
    http_req_failed................: 0.30%  18 out of 5990
    http_reqs......................: 5990   182.869275/s

    EXECUTION
    iteration_duration.............: avg=643.18ms min=608.63ms med=620.63ms max=880.59ms p(90)=728.3ms p(95)=772ms  
    iterations.....................: 1497   45.702054/s
    vus............................: 196    min=1          max=196
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 2.1 MB 63 kB/s
    data_sent......................: 1.3 MB 41 kB/s



running (0m32.8s), 000/200 VUs, 1497 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  32s